{
  "label": "General Resume | Ian Murphy",
  "color": "#8068ff",
  "resumeVersion": "2.4.0",
  "applicant": "Ian Murphy",
  "role": "Full Stack Engineer",
  "website": "http://isogen.net",
  "linkedin": "linkedin.com/in/ian-m-murphy/",
  "email": "ian@isogen.net",
  "phone": "(503) 830 - 2275",
  "github": "github.com/3jackdaws",
  "objective": "Seeking a position at Technology Corp  where I can apply my superior technology skills to ensure a high level of efficiency and productivity.",
  "profile": "Results driven, perfectionist, multi-language full stack engineer who is highly motivated, flexible, and team oriented.",
  "experience": [
    {
      "company": "Natera",
      "title": "Software Engineer III",
      "from": "Feb 2021",
      "to": "Present",
      "description": "Ported, profiled, and optimized complex genomic analysis algorithms with the goal of conforming code to organizational standards, increasing algorithm performance, and decreasing operational costs.",
      "results": [
        
      ],
      "technologies": [
        "Python",
        "Java",
        "NGS Pipelines",
        "DNAnexus"
      ]
    },
    {
      "company": "Daimler Trucks NA",
      "title": "Full Stack Engineer",
      "from": "Mar 2019",
      "to": "Feb 2021",
      "description": "Used agile methodologies to satisfy rapidly changing requirements and deliver production grade features ahead of time as part of a team. Designed and developed a high availability, performance-oriented technical service document delivery application and worked closely with out-of-country teams to integrate experimental APIs. Ensured customer satisfaction of commercial vehicle information applications and microservices through the creation of automated end to end tests and the standardization of development and deployment procedures.",
      "results": [
        "Decrease in deployment validation times for critical applications"
      ],
      "technologies": [
        "Vue.js",
        "Spring Boot",
        "Jenkins",
        "Nuxt.js",
        "Docker"
      ]
    },
    {
      "company": "Intel w/ Cinder Solutions",
      "title": "Automation Engineer",
      "from": "Jan 2019",
      "to": "Mar 2019",
      "description": "Automated validation processes for Intel's Dynamic Tuning product.  Triaged and debugged failing tests.",
      "results": [],
      "technologies": [
        "C#",
        "Jenkins",
        "BDD",
        "Gherkin"
      ]
    },
    {
      "company": "Daimler Trucks NA",
      "title": "Cloud Automation Intern",
      "from": "Jun 2018",
      "to": "Dec 2018",
      "description": "Lead efforts to consolidate steps involved in decommissioning enterprise infrastructure and developed self-service VM decommissioning tools. Was tasked with evaluating and supplying recommendations for the purchase of third party software amounting to more than $200k. ",
      "results": [
        "Solved the infrastructure decommissioning \"million dollar problem\".",
        "Greater than 90% reduction in time to decommission VMs"
      ],
      "technologies": [
        "Django",
        "jQuery",
        "Vue.js",
        "Azure",
        "Docker",
        "Kubernetes",
        "vmWare"
      ]
    },
    {
      "company": "Tektronix",
      "title": "Software Engineer Intern",
      "from": "Jun 2017",
      "to": "Dec 2017",
      "description": "Designed and developed self-service developer tools for product licensing, visual API testing, and building evaluation software. Dockerized high-performance video network monitoring appliance software. Created Cloud provider images (AMIs) from marketplace base OS images for network video monitoring products.",
      "results": [
        "98% reduction in developer time spent obtaining Product licenses",
        "99% reduction in Product software package build time"
      ],
      "technologies": [
        "Python",
        "JavaScript",
        "PHP",
        "PostgreSQL",
        "Docker",
        "AWS"
      ]
    },
    {
      "company": "Vobile, Inc",
      "title": "R&D Intern",
      "from": "Dec 2016",
      "to": "Jan 2017",
      "description": "Oversaw office-wide Windows 10 workstation upgrades. Performed out of box setup and installation of new workstations. ",
      "technologies": [
        "Python",
        "Docker"
      ]
    },
    {
      "company": "Vobile, Inc",
      "title": "R&D Intern",
      "from": "Jun 2016",
      "to": "Sep 2016",
      "description": "Accelerated internal documentation software migration by designing format conversion scripts in Python. Dockerized inventory managment software. Performed intra-office tech support.",
      "technologies": [
        "Python",
        "Docker"
      ]
    }
  ],
  "education": [
    {
      "type": "BS",
      "subject": "Software Engineering",
      "school": "Oregon Institute of Technology",
      "date": "2018",
      "summary": "GPA 3.61 · Emplaced a solid foundation for analyzing problems and providing practical solutions.  Courses included Software Testing, Data Structures, Design Patterns, Operating Systems, Embedded Networking, and Advanced Unix."
    }
  ],
  "skills": [
    {
      "name": "Python",
      "level": 5,
      "sub": [
        "Django/Rest Framework",
        "Flask",
        "Asyncio"
      ]
    },
    {
      "name": "JavaScript",
      "level": 5,
      "sub": [
        "Vue",
        "Nuxt",
        "Node"
      ]
    },
    {
      "name": "Java",
      "level": 5,
      "sub": [
        "Spring Boot",
        "J2EE",
        "WebSphere",
        "JSP"
      ]
    },
    {
      "name": "Docker",
      "level": 5,
      "sub": [
        "Docker Compose",
        "Multistage Builds"
      ]
    },
    {
      "name": "Testing",
      "level": 4,
      "sub": [
        "Hardware Validation",
        "Nightwatch.js",
        "BDD/Gherkin",
        "Selenium"
      ]
    },
    {
      "name": "Jenkins",
      "level": 3,
      "desc": "Experience using Jenkins to automate software distribution and site reliability tests."
    },
    {
      "name": "Git",
      "level": 3,
      "desc": "Experience with using CLI Git and GitLab to collaborate on a team and control software versions."
    },
    {
      "name": "SQL",
      "level": 3,
      "sub": [
        "Postgres",
        "MySQL",
        "SQL Server"
      ]
    },
    {
      "name": "Kubernetes",
      "level": 3,
      "sub": [
        "Rancher"
      ]
    }
  ],
  "projects": [
    {
      "title": "Soundcloud-Lib",
      "category": "API Circumvention Library",
      "url": "https://github.com/3jackdaws/soundcloud-lib",
      "description": "Created after Soundcloud deleted my approved API app so that my Discord bot project could continue to play music in voice channels. Scrapes a public API key from the Soundcloud site and uses it to access the private API.",
      "features": [
        "No API key required",
        "Supports Asyncio",
        "Creates an MP3 with embedded metadata (title, artist, album art)"
      ],
      "technologies": [
        "python",
        "asyncio"
      ]
    },
    {
      "title": "Sling",
      "category": "Collaboration Website",
      "url": "https://github.com/NeonAesthetic/slingapp-net",
      "description": "A room based sharing and collaboration site that features, Text, Audio, and Video Chat, File Sharing, and Desktop sharing via a Chrome extension.  Most realtime communication went over WebSockets, but video and audio data was transmitted peer to peer.  Anyone could make or join a room without an account and room access was granted via share codes.",
      "features": [
        "Securely share Text, File, Audio, Webcam, and Desktop data within a Room",
        "Accountless creation and permanent deletion of Rooms"
      ],
      "technologies": [
        "PHP",
        "JavaScript",
        "WebRTC",
        "WebSockets"
      ]
    },
    {
      "title": "PyCodeExec",
      "category": "Arbitrary Code Execution Library",
      "url": "https://github.com/3jackdaws/pycodeexec",
      "description": "Poorly named library that allows for the safe execution of code from several supported languages via Docker.  This python library spins up a heavily restricted Docker container and executes the provided code.",
      "features": [
        "Safely execute and return output from arbitrary code",
        "Supports Asyncio"
      ],
      "technologies": [
        "Python",
        "Docker",
        "Asyncio"
      ]
    },
    {
      "title": "resume-generator",
      "category": "Simple Resume Management Tool",
      "url": "https://github.com/3jackdaws/resume-generator",
      "description": "A tool I created to allow me to generate custom tailored resumes for different positions.  This resume you are looking at right now was generated with this tool.",
      "features": [
        "Uses a data file to populate a template",
        "Everything I could possibly want to change is a parameter in that data file"
      ],
      "technologies": [
        "Vue.js",
        "HTML",
        "Lots of CSS"
      ]
    }
  ],
  "slug": "main",
  "name": "General Resume | Ian Murphy"
}
